{
    "Keboard_II": {
        "name": "Virtual Keyboard with OpenCV (Part II)", 
        "title": "Create a Virtual Keyboard Project with Python and OpenCV (Part II)",
        "date": "Feburary 11, 2023",
        "type": "academic",

        "url": "Keyboard_II",
        "coverImage": "/images/Virtual_Keyboard.jpg",
        "imgalt": "Virtual-Keyboard-montage",
        "short_desc": "Congratulations! You finished part I of this project. Now let us do something to enable the screen to work with our hands.",
        "content" : [
                {"type"   : "text", 
                "content" : 
                        "On January 17th, 2020, a film named Last Letter was released in Japan. The movie was directed by one of my favorite directors, Shinji Iwai. The story of the movie is the drama of a cross-century romance, and this new release reminds me of Shinji Iwai’s first letter. It is a cinematic creation across the whole century. About a century ago, Marcel Proust, one of the most reputable French novelist, wrote a novel, named A la recherche du temps perdu (Remembrance Of Things Past) and this author emerged a grand significance to Shinji Iwai over a half century later, which is the remarkable movie creation, Love Letter. Love Letter was directed by Shinji Iwai in 1995 and was recognized as one of the director’s best creations. Moreover, the movie Love Letter is the first letter of Shinji Iwai’s creation. Love Letter is deemed to be classic for its romance genre, due to the filming techniques of how it unveils the precious memories that were long lost and neglected in the past, as well as how it relieves obsession about the love that was never meant to be. In a subtle and gentle way, the movie slowly unfolds stories of the past and the present, like one slowly peels an apple until the skin eventually falls off and reveals the flesh."
                }
        ]
    },
        
    "Keboard_I": {
        "name": "Virtual Keyboard with OpenCV (Part I)", 
        "title": "Create a Virtual Keyboard Project with Python and OpenCV (Part I)",
        "date": "Feburary 09, 2023",
        "type": "academic",

        "url": "Keyboard_I",
        "coverImage": "/images/Virtual_Keyboard.jpg",
        "imgalt": "Virtual-Keyboard-montage",
        "short_desc": "Today, we are going to use OpenCV to build this amazing Virtual Keyboard Project.",
        "content" : [
                {   "type"   : "text", 
                    "content" : 
                        "On January 17th, 2020, a film named Last Letter was released in Japan. The movie was directed by one of my favorite directors, Shinji Iwai. The story of the movie is the drama of a cross-century romance, and this new release reminds me of Shinji Iwai’s first letter. It is a cinematic creation across the whole century. About a century ago, Marcel Proust, one of the most reputable French novelist, wrote a novel, named A la recherche du temps perdu (Remembrance Of Things Past) and this author emerged a grand significance to Shinji Iwai over a half century later, which is the remarkable movie creation, Love Letter. Love Letter was directed by Shinji Iwai in 1995 and was recognized as one of the director’s best creations. Moreover, the movie Love Letter is the first letter of Shinji Iwai’s creation. Love Letter is deemed to be classic for its romance genre, due to the filming techniques of how it unveils the precious memories that were long lost and neglected in the past, as well as how it relieves obsession about the love that was never meant to be. In a subtle and gentle way, the movie slowly unfolds stories of the past and the present, like one slowly peels an apple until the skin eventually falls off and reveals the flesh."
                }
        ]
    },

    "VR_system":{
        "name": "Projection Mapping in Home System", 
        "title": "Will projection mapping replace head-mounted displays in a home systems?",
        "date": "March 20, 2022",
        "type": "academic",

        "url": "VR_system",
        "tag": "VR-system",
        "coverImage": "/images/Projection_Mapping_in_Home_System.jpg",
        "imgalt": "VR-system-montage",
        "short_desc": "Recent advances in virtual reality techniques and devices have broadened our capabilities to create innovative immersive environments. The virtual environment created by the VR/AR technology allows users to communicate, entertain or even work in a shared computed-simulated space scene without being physically present.",
        "content" : [
            {   "type"    : "title",
                "content" : "Introduction"
            },{ "type"    : "text", 
                "content" : "Recent advances in virtual reality techniques and devices have broadened our capabilities to create innovative immersive environments. The virtual environment created by the VR/AR technology allows users to communicate, entertain or even work in a shared computed-simulated space scene without being physically present. Such an immersive experience could bring an innovative impact on new forms of communication, collaboration, and even telepresence. With the recent technical innovation and the increasing popularity of virtual environments, there is an increasing trend to own a VR device in a home system. One of the most popular choice so far for a home system would be a head-mounted display (HMD), because of its portability and easy setup. HMDs can be worn on the head and accompanied with a set of controllers for interacting with the virtual world. With more companies publish their VR wearable devices, and more commercial products are established for the users, it seems to be a generally prevalent choice for people to purchase HMDs for their home systems. However, the HMD still have several problems that make them not the optimal device in the home system. When wearing HMDs for longer than approximately six minutes, users could experience motion sickness. Furthermore, the HMDs are intended for a single user which might not be a well-suited choice for a family  home system. User also could experience a real world isolation during the immersive experience when the user can no longer see one's body, one's friends or any surroundings. The real-world isolation could be quite disorienting and uncomfortable for some users during the wearing process. Therefore, researchers are seeking if there is any qualified substitute for HMDs."
            },{ "type"    : "text",
                "content" : "For the past decade, projection mapping, another popular AR/VR technique, is widespread over the world, and one of its greatest difference compared to the HMDs is the capability of letting multiple users simultaneously and directly experience the virtual space without wearing any external devices, such as VR glasses. Projection mapping uses different surfaces as projection targets. Traditionally, projectors are designed to display things onto flat and white surfaces uniformly in a dark environment, but with the improvements in the technology, pricing and sizes of the projectors allow many users to develop or install their own projection mapping projects. Currently, researchers are still investigating the feasibility of applying projection mapping to home systems, and the possibility to replace HMDs in home system. Using projection mapping to create artistic and entertaining illustrations and performance is also now increasingly popular and familiar. Cave Automatic Virtual Environment (CAVE) system and Microsoft's RoomAlive are examples of recent advances in projection mapping technique and have shown how they can be applied in the home system. Based on the existing HMD and projection mapping techniques available, projection mapping has the potential to replace HMD in home systems because of  its better performance in long-duration activities and multi-user settings. Although HMD offers a higher level of immersion, which is desirable for some users, this can be a less critical factor compared to others."
            },{ "type"    : "title",
                "content" : "Related Work"
            },{ "type"    : "subtitle",
                "content" : "Recent Advances in Projection Mapping"
            },{ "type"    : "text",
                "content" : "Near eye displays, such as HMDs, have been the major type of VR device on the market. Recently, there are advances in another type of VR display using immersive projection technology, such as the CAVE system. Cave Automatic Virtual Environment (CAVE) is a room-sized setup where a user could wear a LCD shutter glass to experience virtual reality. The VR display is provided by the projectors around the CAVE environment. Wearing the 3D LCD shutter glasses renders 3D images on the display. The shutter glasses and the HMD both provide two images, one image for each eye. However, the size and the cost of the display make the application in home system to be hard to realize."
            },{ "type"    : "text",
                "content" : "Most of the CAVE systems and large projection mapping systems are mostly used in VR researches, and researchers have been experimenting new ways to apply the CAVE system or projection mapping in various fields. Anselm Grundhöfer in his work summarized the recent applications of projection mapping. With the application of accurate tracking, the projected optical mapping could have a promising use in the field of construction, inspection and reporting. Xaviéra Calixte proposes the case study that used projection mapping as a collaborative design tool for architectural design. Furthermore, Panos discussed projection mapping's impact on tourism marketing."
            },{ "type"    : "image",
                "content" : ""
            }, {"type"    : "text",
                "content" : "Besides the applications in industry and architecture, there are also several projection mapping projects that show the possibility of VR home system for general consumers. Mircosoft research team's RoomAlive project uses five to six projectors and Kinect camera sensors to perform one mapping on a living room with people inside. The system projects an augmented reality onto every surface inside the room: walls, tables, sofas and other objects. The Kinect camera sensors track the player’s movements, allowing them to directly interact with the virtual objects, creatures and environment. This system allows user to avoid using HMDs, and demonstrates the possibility of users' collaboration in the VR system. Still, the game's immersive experience is less competitive than the HMD system. Another solution using power-walls named 'immersive rooms' presents an immersive workspace meeting room. The room's ceiling is installed with 4 projectors and each wall and floor uses glass windows to achieve a 3D projection. At present, the Microsoft research team has not planned to release the RoomAlive as a standalone consumer product and Immersive Rooms has not yet developed a specific product for a home system."
            }, { "type"   : "subtitle",
                "content" : "Presence and Immersion in Home System"
            },{"type"     : "text",
                "content" : "Presence and immersion are crucial criteria when the effectiveness of a virtual experience is evaluated. Presence is the extent to which a person’s cognitive and perceptual systems are tricked into believing they are somewhere other than their physical location. When home systems are designed with VR applications, no matter which hardware devices are applied, the goal of the design is to give the users a high level of presence to better interact with the virtual environment. Another factor to the virtual experience is immersion. Immersion in the virtual reality would be an experience that one person is feeling isolated from the reality world and placed in the virtual world instead . The most common application scenarios of virtual reality home systems are movie watching and video gaming. When watching movies in home system, the audience can feel immersed into the movie world, but still cannot have any interaction.  On the other hand, for virtual video games, the players would play in an isolated virtual world with a generally high level of interaction with the environment or other players in the same virtual space. Inside a virtual world, the feeling of immersion is positively correlated with the level of the interaction. One of the known challenges associated with designing VR devices is physical ergonomics. Display devices, in particular, evoke a high level of presence and immersion, but often cause simulator sickness, a variant of motion sickness. The physical discomfort caused by wearing display devices limit the time user can use the device, and severe symptoms include loss of skin color, dizziness, nausea, and vomiting.  For the design of an entertaining home system, how much the user experiences simulator sickness is an important concern when deciding the type of hardware device to apply to the home system in addition to considering the level of presence and immersion."
            },{ "type"    : "subtitle",
                "content" : "HMD vs Projection Mapping in Cognitive Task Performance"
            },{ "type"    : "text",
                "content" : "In order to find a balance between engagement with the virtual world and physical discomfort, researchers have been conducting various research on comparing task performances wearing HMD and using a HMD alternative. Additionally, the high cost for a single head-mounted display could also reduce its popularity, but projection mapping could be a cheaper reasonable substitute. The research goal is to determine whether projection mapping offer similar cognitive experience as head-mounted display while taking advantage of its cheaper cost and comfort level. One of the most intuitive experiment is to use one traditional large projection screen to act as an alternative to head-mounted display. Emilee Patrick's group suggests that under two conditions, head-mounted display condition and large projection screen conditions, the participants' ability to reproduce a cognitive map of one virtual environment has no statistically significant difference. As an implication from the study, they believe that a large projection screen might be an operative, cheap substitute for an head-mounted display. Although the above study shows no significant difference in cognition with those two displays, they did not compare other factors, such as the user feedback in immersive experiences or ability to accomplish other tasks. James Brooks  proposed a study that compares the performance between the head-mounted display and flat screen in a Micro-UAV target detection task. Their results show that there is no significant difference using two display conditions. Furthermore, they also pointed out one potential issue of the HMD which is the simulator sickness. Their results recorded that The level of simulator sickness, physical discomfort, and mental workload are notably higher for the participants using HMDs. More recently, Priyanka Srivastava proposed a finding that offers another possible alternative  by simply using a desktop display. The study considered how non-ambulatory HMDs and desktop display affect spatial learning. They concluded that the naive participants in the experiment would spend more time and perceive less motion-sickness during spatial learning. As in the comparison of the task, participants using desktop display performed better in recalling spatial components and equally well in other tasks."
            },{ "type"    : "text",
                "content" : "Furthermore, CAVE is also one of the best VR immersive devices available. Enrico Ronchi proposed one study that compared the two different VR methods in tunnel evacuation tasks, specifically the investigating the emergency exit portals' flashing lights design. They conclude the results using two different VR methods are consistent. Enrico Ronchi also pointed out one of the most common issue for CAVE system is the extremely high cost. In comparison, the HMDs would be relatively costly-efficient. Then the performance difference between the HMDS and CAVE-like system would reveal by the disparity of the collaboration."
            },{ "type"    : "title",
                "content" : "Projection Mapping For Short and Long Duration Tasks"
            },{ "type"    : "text",
                "content" : "Projection mapping can be a reasonable substitute for HMD in a home system for both short and long-duration tasks.  Inevitably, a fully immersive VR experience with the HMD generates motion sickness, thus it is not an ideal device for long-duration tasks. Therefore, if such projection mapping systems could replace HMD in short-duration tasks and also be capable of supporting users in long-duration tasks, then such systems could be more popular in home systems since it provides the possibility to realize the functionalities such as remote education, communication and home cinema."
            },{"type"     : "text",
                "content" : "Both HMDs and projection mapping systems provide an immersive experience for the users in virtual reality. HMDs could provide a fully immersive experience for users but the projection mapping systems such as RoomAlive could only provide an immersive experience to some extent. However, the difference between the level of immersion should not affect how users perceive the virtual environment in settings such as VR meetings and home cinemas. In those functionalities proposed above, few of them require a fully immersion setup to have a satisfying experience. Most of the functionalities, moreover, encourage multiple users to share the virtual experience in one system. For example, if a family wishes to have a home system to watch movies in virtual reality, it would be reasonable to choose a set of systems that members could use together instead of each member wearing a HMD device individually. If we use the CAVE system as a prototype to compare with HMDs, the projection mapping systems have larger screen displays with higher resolution. Furthermore, another evaluation standard would be the front of view (FOV). Both Seay and Lin pointed out that participants who experienced the virtual environment with a high FOV reported greater sense of presence than those in the low FOV conditions. CAVE systems provide around FOV up to 170 degrees and HMDs up to 100 degrees. Even though the CAVE systems could not provide the same degree of same immersion as the HMD does, but in the home system, the CAVE system provide users a high level of presence."
            },{"type"     : "text",
                "content" : "More importantly, when trying to use HMDs in long-duration tasks, as Dennison concluded that participants reported severe motion sickness while using an HMD but not while viewing images displayed on a monitor. Furthermore, half of the participants chose to quit the experiment after six minutes of HMD use and reported feeling nauseous at that time. The reason for such sickness is when wearing a HMD, the brain will think one is moving but in fact the body stays still. This generates a disconnection between the body and brain, which then causes enough confusion to trigger motion sickness and one would feel nauseous. By far, in some of the projection mapping systems, the projections of virtual space are directly mapped to the reality, then the users could experience an augmented reality while actually moving their body freely in the reality space. This could in some extent avoid the degree of motion sickness. Furthermore, in comparison accommodation, the closer screens in the HMDs could also cause discomfort to the users. On the contrary, the CAVE systems enable for extended usage. With less physical discomfort for the users, the projection mapping systems have the possibility to be popular for supporting users in doing long-duration tasks."
            },{ "type"    : "image",
                "content" : ""
            },{"type"     : "title",
                "content" : "Projection Mapping For Multi-user Settings"
            },{"type"     : "text",
                "content" : "Projection mapping can easily replace HMD under scenarios when multi-user collaboration is required. Currently most of the HMD applications are designed for the individual users and individual users only. The collaboration in virtual reality is limited because all users involved would all need an individual HMD. This section will focus on the potentials of projection mapping system in multi-user collaboration. With its potential for sharing and collaborating, projection mapping has a stronger social attribute, which makes it a popular choice for families, or a group of friends because projection mapping has less face blocking and could be financially affordable for a group of users."
            },{"type"     : "text",
                "content" : "One of the main constraint of HMD is limited collaboration. While users wear a HMD, it creates not only a fully immersive but extremely personal experience. For home systems, if reviewing the system independently, the HMD will suffice for such a design, but productive collaboration between friends and family members can be impaired when presenting such a design. Even though avatars can be added in VR contents, and collaboration functionalities could be gradually implemented in virtual environment to address this issue, the limitation in collaborative experience still remains. One of the other reason is each user's FOV and tracking is independent from other users even they are present in the same virtual space. Projection mapping system, on the other hand, allows more than one users to fully immersed in and interact with their virtual models by using 2 to 6 screens simultaneously. As the evacuation research proposed by Enrico Ronchi implies that the HMD has the capability for one single user to perform the evacuation in a simulated situation, but the CAVE system could perform in a better simulated situation since multiple users could be placed in the same virtual space and the evacuation could be simulated with the addition of group collaborations."
            },{"type"     : "text",
                "content" : "Another main advantage of projection mapping in collaboration settings would be less face blocking. Currently, most of the HMDs are blocking the user's upper face during the wearing process. As Yajie Zhao’s team pointed out that 'eye contact and effective face-to-face communication remain difficult in VR/AR environments as the HMD occludes a large portion of the face.' Indeed, recent advances in 'Mask off', a solution to remove the blocking of the HMDs in real-time display, can help mitigate the issue. The solutions would require extra external devices and pre-recordings involved in the wearing process. Zhao's solution required one additional RGB camera and two infrared cameras inside the HMD, and pre-recorded video sequence of the user is also required. On the other hand, the projection mapping allowed multiple users in the same room and the users could directly see each other, thus there could be less or even no face blocking. For example, the RoomAlive prototype allows users to touch, shoot, stomp, dodge, and steer projected content that seamlessly co-exists with their existing physical environment. Even wearing specific glasses, users still can directly see others’ facial expressions and make eye contact."
            },{"type"     : "text",
                "content" : "On the other hand, if a family owns a single HMD in one home system, different users need to take turns but not able to use the device at the same time. If a family needs to have a VR system for all the members could use at the same time, then inevitably multiple HMDs are required. If one of the projection mapping system could be financially affordable for a family, then from the angle of pricing, the projection mapping system also exists the potential to become more popular than HMD in the future."
            },{"type"     : "text",
                "content" : "For home systems, one of the most important utility is to allow every one's participation. So far, the collaboration in HMD are still quite limited, and projection mapping systems has the great developing potentials for multiple users to cooperate and collaborate."
            },{"type"     : "title",
                "content" : "Trade-offs using the projection mapping system"
            },{ "type"    : "text",
                "content" : "As shown in the previous sections, there are factors that make projection mapping systems more popular than HMDs. However, there are some characteristics of HMD that could not be fully replaced by projection mapping. One of the clearest advantages of HMDs is the size and high portability of the device. Since the CAVE system uses projectors and screens, then it is certain that it takes more space than HMDs and have more requirements on the physical space. To set up a CAVE system for a home system, a minimum of two walls are required and even can go up to 6 sides of the cube when adding a floor and a ceiling to all 4 walls. In comparison, HMD users could set up their devices by only using a very small amount of space. It is also easier to carry one HMD with the user to wherever the user chooses to go. On the other hand, moving a CAVE system would be an expensive and challenging project. However, for in-home systems, it would be reasonable to assume the users might not choose to carry the devices all around and the users should have at least reasonable space in the house which allows for VR systems: the minimum two walls requirement should be satisfied. Furthermore, the RoomAlive prototype proposes the possibility that small-scaled CAVE systems and light-weighted projectors and a simple setup mechanism of the device could increase the portability of the projection mapping system. Also, projection mapping allows projection onto any already existing items which demonstrate the possibility of using the existing room for a virtual reality space. Because projection mapping does not block users’ eyes from reality, users do not need to worry about their actions in virtual space that might accidentally break their furniture in reality. Basically, every HMD setup would require users to enter a rather empty space before they put it on. Still, the HMDs might prevail in migration and flexibility consideration."
            },{ "type"    : "text",
                "content" : "The other clear advantage of HMDs is its user immersion and interaction. Firstly, CAVE systems are immersive to an extent but HMDs are completely immersive because users are not able to see the physical world or the user's own body. The fully immersive experience might be important for some users, such as video game players, and when using the CAVE system, users may have a stronger sense of the self and the physical surroundings compared to using HMD. Furthermore, most of the HMDs are accompanied by finger tracking devices. Then for the level of interactions, HMDs provide better and wider functionalities that allow users to have more interactions. On the other hand, the CAVE systems are still relying on motion tracking and buttons for interaction. Projection mapping has the potential to provide a better interaction mechanism, as, for example, the RoomAlive system allows users to touch, shoot and point. The highly immersive experience is still one of the irreplaceable characteristic of HMD. For a home system, it could be a trade-off for users to select either individual and fully immersive virtual experience or collaborative and not fully immersive virtual experience in the home system."
            },{"type"     : "title",
                "content" : "Discussion"
            },{ "type"    : "text",
                "content" : "Studies have shown how users perform equally well or even better in cognitive tasks using a projection mapping system compared to using a HMD. It is important to note that when users experience motion sickness with a HMD, it negatively affects users' ability to understand the virtual environment, thus making it less effective than projection mapping system in some cases. Projection mapping system's advantage in engaging in long-duration activities and collaboration tasks could make it a highly favorable choice as a home system. It is also extremely clear that there exists irreplaceable characteristics of HMDs, such as the fully immersive experience and the flexibility to use in any location. Even though the HMDs have better portability and flexibility, those do not make HMDs the only ideal device when applying VR in home systems, since users would not require to change the location of the device very often. Furthermore, projection mapping is also capable of providing users an immersive experience which allows users to understand the virtual environment cognitively equally well as using HMDs. In conclusion, it is possible to have a projection mapping system to replace head mounted display and also has the potential to become popular if it can perform better in long-duration activities and collaboration tasks."
            },{ "type"    : "text",
                "content" : "As we have shown above, the projection mapping systems have great potential in home system in the future, but both HMDs and projection mapping systems still face grand challenges in providing the users a comfortable and consummate virtual experience. The costs, on the hand, both of the device equipment are not easily affordable for common families. To increase the popularity of VR, it is also critical to demonstrate the convenience and necessity of VR devices could bring to the home systems. Most of the families still consider the VR/AR devices as entertaining complements, but not life essentials."
            },{ "type"    : "text",
                "content" : "Furthermore, there is also the possibility of combining the projection mapping systems and HMDs into one integrated system. Since the interaction mechanism in most of the projection mapping systems are falling behind the HMDs, if combining the hand tracking devices into the projection mapping systems also increases the chances and spaces for interaction. For both of the systems, further research is needed for outdoor settings, and it is also crucial to see the advances in the VR and PC hardware as they support better user experience in display resolution, speed, and exploring more user scenarios."
            }
        ]   
    },
    
    "Love_Letter" : {
        "name": "Love Letter", 
        "title": "Trace to the First Love Letter",
        "date": "March 04, 2020",
        "type": "article",
        
        "url" : "Love_Letter",
        "tag": "love-letter",
        "coverImage": "/images/love_letter.jpg",
        "imgalt": "love-letter-montage",
        "short_desc": "On January 17th, 2020, a film named Last Letter was released in Japan. The movie was directed by one of my favorite directors, Shinji Iwai. The movie was directed by one of my favorite directors, Shinji Iwai. The story of the movie is the drama of a cross-century romance, and this new release reminds me of Shinji Iwai’s first letter.",
        "content" : [
                {"type"   : "text", 
                    "content" : 
                            "On January 17th, 2020, a film named Last Letter was released in Japan. The movie was directed by one of my favorite directors, Shinji Iwai. The story of the movie is the drama of a cross-century romance, and this new release reminds me of Shinji Iwai’s first letter. It is a cinematic creation across the whole century. About a century ago, Marcel Proust, one of the most reputable French novelist, wrote a novel, named A la recherche du temps perdu (Remembrance Of Things Past) and this author emerged a grand significance to Shinji Iwai over a half century later, which is the remarkable movie creation, Love Letter. Love Letter was directed by Shinji Iwai in 1995 and was recognized as one of the director’s best creations. Moreover, the movie Love Letter is the first letter of Shinji Iwai’s creation. Love Letter is deemed to be classic for its romance genre, due to the filming techniques of how it unveils the precious memories that were long lost and neglected in the past, as well as how it relieves obsession about the love that was never meant to be. In a subtle and gentle way, the movie slowly unfolds stories of the past and the present, like one slowly peels an apple until the skin eventually falls off and reveals the flesh."
                },{"type"  : "text", 
                    "content" : 
                            "The audience might be completely confused by the beginning of the movie. The narration of stories of the two main female characters, Hiroko Watanabe and Itsuki Fujii, are intercalated, and the faces of those two characters are the same. Thus, their lives might not be easily well separated, even though the two storylines are intercalated. Moreover, there is one more confusion in the settings of the movie. The two characters with the same name, Itsuki Fujii. The name of Hiroko’s dead is Itsuki Fujii, and this name is shared by the other female character. Those occasions interweaved to form a giant mystery that was slowly revealed with the movie’s progress. To start from the beginning, the main character, widow Hiroko Watanabe Watanabe mailed a letter to his dead husband’s hometown after she left his death anniversary. She was simply wishing to have a closure to her past and to end her grief of her dead husband, but accidentally she received a response. The message sent by Hiroko said “How are you recently? I am actually still fine.” It was a letter doomed with no response. However, she received the letter with the information: “I am fine, just with a light cold.”"
                },{"type"  : "text", 
                    "content" : 
                            "The stories of what happened after this simple response I wish to remain a secret to the readers. The stories between the three characters are slowly revealing with the development of the movie. The techniques of the entire plot was about two different women with the same look and the movie from the beginning to the end was interspersed. It was a quite common technique used in novel creations. The author might choose to use odd number chapters for one character’s stories, and use even number characters for the other character’s stories. The timeline of each story is followed chapter by chapter. Even though the protagonists are changed continuously, the story still appears as a whole. In 1995, it was courageous for a director to use such montage for an entire movie. From la grande syntagmatique (the large syntagmatic category) written by French film theorist, Christian Metz, we can acknowledge that there are four different insert montage techniques: l'insert subjectif, l'insert diegetique deplace, l'insert explicatif and l'insert nondiegetique. Those could be roughly translated to subjective insertion, diegetic insertion, explanatory insertion and non-relevant insertion. The technique adopted by Shinji Iwai would be the second one. Iwai used two story sequences and each section in the sequence is continuous. The purpose of this demonstration is to show that different events happen simultaneously. The movies were full of occasions, but this intersection between two storylines cleverly eliminates the abruptness of each unreasonable occasion."
                },{"type"  : "text", 
                    "content" : 
                            "With the occurrence of sending and receiving the letters, Hiroko would like to meet this mysterious woman who has the same name as her husband. Although the scenes are picturing both women, the plot and the structures of the movie cleverly avoid the encounter of the two women at the first half of the movie. Hiroko went to the address printed on the letter of the response. It was certainly now the female Itsuki Fujii’s house, and reasonably those two characters should meet with each other. The director, however, would prefer more mystery in the plot and thus make the arrangement that Itsuki Fujii will be at the hospital at the same time when Hiroko arrives at Fujii’s front gate. Even though the two storylines changed continuously, those two characters just could not meet each other directly. Just because of this impossibility, the audience would be always curious about what would be on the next scene."
                },{"type"  : "text", 
                    "content" : 
                            "Besides the innovative structures of the movie, the scenes were also epic. To most of the audience, the two most expressive scenes would be the two shots, one at the start and one at the end. At the beginning of the movie, the protagonist Hiroko had just finished the death anniversary of her husband. Hiroko was lying in the snow with reminiscence and sadness. The entire setting of that landscape with the side portrait of the face of Hiroko was truly enchanting. After Hiroko climbed up from the snow, and slowly walked down the mountain, Noboru Shinoda, the cinematographer of the movie, used a technique called “spot moment”. Hiroko was wearing a black jacket walking in the giant white snow. She was tiny in contrast to the entire widescreen of snow like a spot in the composition. Moreover, the black color of her jacket has a more vibrant contrast to the bright white color of the snow. The scenes rendered a feeling of yearn for the naturals, which revealed Hiroko’s wish to be relieved from her husband’s death hidden deep in her heart."
                },{"type"  : "text", 
                    "content" :
                            "Another impressive scene would be the ending of the movie, when the myth of why Hiroko's dead husband shares the same name with Itsuki Fujii is finally revealed. In the meantime, the love story embedded in the time also unveils. I truly wish not to spoil the entire movie, and luckily the filming techniques about that scenes were not absolutely worth analyzing. However, there is indeed one more filming technique that truly deserves to be discussed - the widescreen camera works, adopted by Noboru Shinoda. In 1995, when the cinema did not completely accept widescreen work in Japan, Shinoda used his extraordinary filming skills to accomplish the task. Thanks to human convention, the widescreen is more cinematic. The obstacles were tremendous at that time, cameras, projectors and other filming equipment were used to have the original ratio which is 4 to 3. However, for better visualization, Shinoda insisted to film the entire movie by widescreen ratio."
                },{"type"  : "text", 
                    "content" : 
                            "The dialogues between Hiroko and one of her admirers, Akiba Shigera, were shot by the static cameras and also motion cameras. The start of dialogue was quite peaceful, the cameras were static and then Shigera slowly walked close to Hiroko and Hiroko intentionally to keep distance between her and Shigera. Those shots were generally short and filmed by moving cameras. When both characters once stood still, the cameras switched to static. Afterwards, Shigera suddenly approached Hiroko and tried to kiss her, the shots were moving. Once he kissed her, the shots became static and a close-up to the lips. For the moving shots, the cinematographer did not use any stabilizing equipment to make the scenes more smooth. However, the director merely required the hand-hold camera to make the scenes look as natural as possible."
                },{"type"  : "text", 
                    "content" :
                            "With many previous movies, I have analyzed different ways a director would choose to use when dealing with the matter of death. In the movie, the funeral, the whole movie uses a documentary style to record the entire process of the funeral, but generated a stronger impact on people facing the matter of death. Without any exception, Iwai also used distinctive techniques for the filming of death. Different deaths were across the entire movie. At the beginning, there was the death ceremony for Hiroko's husband. Moreover, when Fujii’s cold got worse, she was taken to the emergency room. Fujii fell asleep in the waiting hall of the hospital and she suddenly saw her father lying in the ICU. The focus was switching quickly, the shots changed from clear to vague and changed from vague to clear. The death under these shots were in sorrow rather than merely sadness."
                },{"type"  : "text", 
                    "content" :
                            "Despite the grand success of the ratings and bookings of the movie, Love letter is also a milestone in Japanese movie history. After World War II, South Korea comprehensively prohibited the Japanese media. However, this movie was released in South Korea and was uniformly applauded by the local audience. The enormous cultural impact plays an important role in helping to break down the post-World War II barrier between the two countries."
                },{"type"  : "text", 
                    "content" :
                        "At the present, the Last letter produced by Shinji Iwai, is still a drama and romance movie around the information of letters. Even with the same genre as the Love letter, the new movie was still applauded by the audience. The stories behind the letters are unique and the emotions written on the papers are true without any exaggerations. The sentences used in the movie were simple and concise: “ How are you recently?”, “I am fine.” However, behind the short and simple words are the hidden emotions of deep affection and how heartly one misses another. Shinji Iwai could gently express that warm feeling to the audience, with the not so unrealistic stories but the completely true feelings. Twenty years after the release of Love Letter, people are still fond of this kind of movie, because the emotions are permanent. Like Iwai wrote in his novel, “Even with the rush of the time, the sincere emotions do not have changed. Life might be short and cursory, but Love is ageless.” I believe that is what he tried to express in the Love Letter. After twenty years, what he tries to express is still unchanged."
                },{"type"  : "text", 
                    "content" :
                        "If the Love Letter is the beginning of the entire chapter, I assume the Last Letter would be the last chapter of the era. I feel extremely fortunate to have the chance to witness the entire film career of one remarkable director. Shinji Iwai said if there is one you could miss, that would be happiness. For a movie enthusiast, there is always one movie directed by Shinji Iwai that I could look forward to, I believe that would be my simplest happiness."
                }   
        ]
    }
}